app/controllers/translation_controller.rb

SELECT  "translations".* FROM "translations" WHERE "translations"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def show
    @translation = Translation.find(params[:id])

INSERT INTO "translations" ("from", "created_at", "updated_at") VALUES (?, ?, ?)  [["from", "r"], ["created_at", "2017-08-06 11:42:57.409465"], ["updated_at", "2017-08-06 11:42:57.409465"]]
---
  def create
    @translation = Translation.create(params[:translation].permit(:from,:direction))