app/controllers/translation_controller.rb

  def index
    @translations = Translation.all
---
SELECT "translations".* FROM "translations"