app/controllers/translation_controller.rb

SELECT  "translations".* FROM "translations" WHERE "translations"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def index
    puts @current_user.username
    @translations = Translation.where user_id: @current_user.id