app/controllers/user_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "password", "username", "persistence_token") VALUES (?, ?, ?, ?, ?)
---
  def create
    user = User.new(params.require(:user).permit(:username,:password))
    if user.save