app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "abcd1"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def authenticate
    username = params[:user][:username]
    password = params[:user][:password]

    user = User.find_by username: username
    puts user.username

    if user.password == password
      session = UserSession.new(user, true)
      session.save
      puts UserSession.find.user.username